// 网易面试题

// --------------------- 一面 ---------------------------
// localstorage 是不是和cookie一样，是否不同域名可以访问，服务端怎么删除cookie

// 加密种类，https

// 如何清空数组

// 生成1000 'a' 的字符串

// position的值，给了一个具体的案例分析

// relative相对于谁

// 清除浮动元素

// var a= [1]; var b = a; a = []; console.log(b); a.length = 0; console.log(b);

// react中捕获冒泡事件。

// addEventListener(), 移除事件绑定; 事件中的this指的是谁
// removeListener 移除单个事件
// getEventListeners 获取所以事件，然后移除

// call apply bind

// bfc/flex

// videojs 实现原理，直播格式

// 图片种类及区别，怎么压缩

// 跨域，jsonp的缺点

// 浅拷贝，深拷贝

// --------------------- 二面 ---------------------------
/**
 * 手写实现Promise.all
 *
 * 手写原型链继承
 *
 * webpack 打包机制，打包流程，插件的作用
 *
 * http协议，get和post请求区别，restful api设计
 *
 * 给了一个具体的情况说出解决方法。（页面中的歌曲表单会有第三方复制粘贴抓取，如何解决）
 *
 */

// --------------------- 三面 ---------------------------
/**
  *
  * 测试框架的覆盖率及效果
  *
  * 获得过什么荣誉
  *
  * 平时看什么书
  *
  * 手写深拷贝
  *
  * 给了一个题目，说出答案，主要考察的是apply, bind, call中this的指向
  *
  * 做一个Google/baidu那样的搜索栏，需要考虑的点有哪些
  *
  * 项目中主要起什么作用，写项目过程中的亮点有哪些
  *
  */
